  SORT FIELDS=(101,6,CH,A,26,25,CH,A)                                   00000100
  MODS E15=(E15EXIT)                                                    00000200
