     DSN      SYSTEM (DB7R)                                             
     RUN PROGRAM(ZBNKEXT1) PLAN(BNKDEMO)                                
     END                                                                
