       01  CD01-DATA.                                                  
001500     10  CD01I-DATA.                                               
001600       15  CD01I-PERSON-PID                  PIC X(5).             
001700     10  CD01O-DATA.                                               
001800       15  CD01O-PERSON-PID                  PIC X(5).             
001900       15  CD01O-PERSON-NAME                 PIC X(25).  
