008400 01  LOAN-ENQUIRY.                                                 
027800         20  BANK-SCREEN70-DATA.                                   
027900           25  BANK-SCR70-AMOUNT             PIC X(7).             
028000           25  BANK-SCR70-RATE               PIC X(7).             
028100           25  BANK-SCR70-TERM               PIC X(5).             
028200           25  BANK-SCR70-PAYMENT            PIC X(9). 
