006400  01  CD06-DATA.                                                  
001600       15  CD06I-PERSON-PID                  PIC X(5).             
001800       15  CD06I-FROM-ACC                    PIC X(9).             
001900       15  CD06I-FROM-AMOUNT                 PIC S9(7)V99 COMP-3.  
002000       15  CD06I-FROM-DESC                   PIC X(30).            
002100       15  CD06I-TO-ACC                      PIC X(9).             
002200       15  CD06I-TO-AMOUNT                   PIC S9(7)V99 COMP-3.  
002300       15  CD06I-TO-DESC                     PIC X(30).            
