001400 01  HELP01-DATA.                                                
001500     10  HELPO1I-DATA.                                             
001600       15  HELP01I-SCRN                      PIC X(6).             
001700     10  HELP01O-DATA.                                             
001800       15  HELP01O-SCRN                      PIC X(6).             
004200       15  HELP01O-INDIVIDUAL-LINES.              
004300         20  HELP01O-LINE OCCURS 19 TIMES    PIC X(75).             
                                                                  
